blog/02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building a Foundation: Knowledge Building</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Building a Foundation: Knowledge Building</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org26192af">Profiling Profiles?</a></li>
<li><a href="#orgb57b5ea">A Systematic Approach</a></li>
</ul>
</div>
</div>
<p>
In an effort to build out a foundation of knowledge in pursuit of my goal (essentially becoming a social change advocate), I see two distinct ways of doing so. First is, of course, going out and researching and compiling information from various sources, and second, trying to apply this information in a meaningful way.
</p>

<p>
Of course the plan was always to use media to convey complex topics through social media posts and other channels, but in between researching and creating such media, I want a sort of buffer that will serve as a learning tool for myself and an educational tool for others.
</p>

<p>
As such, I have set up <a href="https:profileprofiles.com">profileprofiles.com</a>, a wiki that will help me sort out my thoughts and organize information in a detailed fashion and serve as an index of information for how organizations and events triggered by them influence political, legal, economic, and technological systems.
</p>

<div id="outline-container-org26192af" class="outline-2">
<h2 id="org26192af">Profiling Profiles?</h2>
<div class="outline-text-2" id="text-org26192af">
<p>
I'm quite pleased with myself for securing this domain , actually; it can be construed in quite the clever way.
</p>

<p>
The way I interface with the idea of profiles (outside of social media profiles) is related to the show <a href="https://en.wikipedia.org/wiki/Criminal_Minds">Criminal Minds</a>, a procedural crime drama.
</p>

<p>
In the show, the FBI agents who are tasked with episode by episode bad guy of the week would, for the most time refer to a sort of character profile to try to predict the bad guy's next moves.
</p>

<p>
Not far off, I'm sure, from how actual intelligence agencies operate, these profiles were basically aggregated and grouped characteristics about the nature of the crimes committed, how, and when, which would then attempt to generate a silhouette or picture of who the unknown criminal might be.
</p>

<p>
Basically they would deduce (infer), based on previous crimes committed and who was found guilty, who the criminal was likely to be. Hence the name <i>Criminal Minds</i>.
</p>
</div>
</div>

<div id="outline-container-orgb57b5ea" class="outline-2">
<h2 id="orgb57b5ea">A Systematic Approach</h2>
<div class="outline-text-2" id="text-orgb57b5ea">
<p>
I'm probably not going to go in such a roundabout way of inducing some big mystery. Banks are banks, states are states, and the intelligence agencies are intelligence agencies. However, I will be trying to get a big-picture view of how things operate and influence each other.
</p>

<p>
I'm still not quite sure on the structure of things, but I do know one other thing. I want the website to kind of read like a book.
</p>

<p>
Thanks to the application I'm using, <a href="https://tiddlywiki.com\">TiddlyWiki</a>, this should be a pleasing process. TiddlyWiki is basically a single page wiki where you can interlink ideas and topics seamlessly and in quite elaborate and organized ways.
</p>

<p>
Users will hopefully be able to go down a path I have set out for them, or create a unique experience that interests them all, as the wiki is modularly set up so you get to control how you consume the information.
</p>

<p>
Right now the wiki is just a single page, but I hope to slowly build it out. This will serve as a second layer of quality control before I take the information and make it adaptable for the masses.
</p>

<p>
Well, that's all for now. Thank you for tuning in!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-03 Sat 20:08</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
